xchange-kraken/src/test/resources/org/knowm/xchange/kraken/dto/account/example-ledgerinfo-data.json

{
  "error": [
  ],
  "result": {
    "ledger": {
      "LDVXGZ-2FJSK-FJWOGJ": {
        "refid": "LAJSKG3-35JF4-JF0JG3",
        "time": 1549990357.125,
        "type": "adjustment",
        "aclass": "currency",
        "asset": "XICN",
        "amount": "-350.0000000000",
        "fee": "0.0000000000",
        "balance": "0.0000000000"
      },
      "LQY6IE-WNT47-JRBOJV": {
        "refid": "QGBJIZV-4F6SPK-ZCBT5O",
        "time": 1391400160.0679,
        "type": "deposit",
        "aclass": "currency",
        "asset": "XXBT",
        "amount": "0.1000000000",
        "fee": "0.0000000000",
        "balance": "0.1000000000"
      },
      "LWL3TV-BC7TE-EUZ5ZQ": {
        "refid": "AMBEDD7-NVKRCP-KBXHHD",
        "time": 1389073995.0882,
        "type": "withdrawal",
        "aclass": "currency",
        "asset": "XLTC",
        "amount": "-15.9857300000",
        "fee": "0.0200000000",
        "balance": "0.0000000000"
      },
      "LFFMB7-JZ3H7-GAFCYA": {
        "refid": "TY5BYV-WJUQF-XPYEYD",
        "time": 1389071942.2335,
        "type": "trade",
        "aclass": "currency",
        "asset": "XLTC",
        "amount": "16.0378100000",
        "fee": "0.0320800000",
        "balance": "16.0057300000"
      },
      "LVKQPQ-OUYTL-BF7HAR": {
        "refid": "TY5BYV-WJUQF-XPYEYD",
        "time": 1389071942.2319,
        "type": "trade",
        "aclass": "currency",
        "asset": "XXBT",
        "amount": "-0.5000000000",
        "fee": "0.0000000000",
        "balance": "0.0000000000"
      },
      "LE6MUP-7QBUT-GSQYZY": {
        "refid": "QGBHSDV-WNIG7Y-TNHTJ4",
        "time": 1388739905.0371,
        "type": "deposit",
        "aclass": "currency",
        "asset": "XXBT",
        "amount": "0.5000000000",
        "fee": "0.0000000000",
        "balance": "0.5000000000"
      },
      "L23XKW-ZZHEP-FJINZ3": {
        "refid": "TPYCPK-GLBCV-NGPDDI",
        "time": 1388739905.0371,
        "type": "settled",
        "aclass": "currency",
        "asset": "XETH",
        "amount": "0.5000000000",
        "fee": "0.0000000000",
        "balance": "0.5000000000"
      },
      "LKEGD3-PO6FF-3CCK7Z": {
        "refid": "Unknown",
        "time": 1388739925.0371,
        "type": "staking",
        "aclass": "currency",
        "asset": "XTZ",
        "amount": "0.01847200",
        "fee": "0.0000000000",
        "balance": "130.44704300"
      }
    },
    "count": "8"
  }
}